# Тема :  множества
# Множества бул python программалоо тилинде озгоручуу жана упорядочный типке  кирбеген уникалдуу колекция элементтери!
# Множествада элементтер кайталанбайт , рандомный порядкада журот
# Словарь менен множестванын айырмасы, биз словарьда ачкыч жана маани берсек ал эми множествада жонокой эле мааниде жасылат

# .Пустой set жаратуу жолдору :
# 1)
# a = {}
# print(a)

# 2)
# os = {1, 2, 2, 4}
# print (os)

# Множествада бир элемент эки жэ андан коп окшош болуп жасылса , множества бизге бироону гана чыгарып берет!


# n = {}
# print(type(n))

#  пустой множестваны аныкташ учун фигурный скобканын ичинде хотябы бир элемент болуш кере
# n = {1}
# print(type(n))
  

#   Множестванын операторлору жана методдороу!
# Оператор in
# s = {1, 2, 3, 4}
# print (3 in s)


# Метод discard() -бул метод словарьдан  элемент жок кылуу кызматын аткарат!
# tes ={2, 4, 6, 8}
# tes. discard(4)
# print (tes)
  

#   Метод   update()  бул метод словарьга элемент  рондомно кошуу кызматтарын аткарат!

# Метод leset = {129, 'world', 78}
# set. update('hi')
# print(set)


# len() - бул метод словарьда канча элемент бар экенин аныктайт!
# set = {12, 44}
# print(set, len (set))


# Множестванын кесилиши (sets)
# a = {1, 2, 3}
# b ={4, 5, 6}
# print(a & b)

# Множестванын кошулушу (sets)
# a = {1, 2, 3}
# b ={4, 5, 6}
# print(a | b)


# Множестванын кеметуусу
# a = {1, 2, 3, 4}
# b ={3, 4, 5, 6}
# print(a - b)

# print('*')
# print('*' * 2)
# print('*' * 3)
# print('*' * 4)
# print('*' * 5)
# print('*' * 6)
# print('*' * 7)
# print('*' * 8)



# a = '*'
# while a <= '*******':
#     print(a)
#     a += '*'
    